Tekla Open API Reference for Tekla Structures 2025
Assembly.GetMainPart Method
 Selects and returns the main part of the assembly or null if none.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject GetMainPart()
Public Function GetMainPart As ModelObject
Return Value
Type: ModelObject
The main part of the assembly or null.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace